


truncate fsm;
insert into fsm (FSMID,name,fnid,initstateid) values 
(1,'organization',null,10),
(2,'repo',1,20),
(3,'office',1,30),
(4,'server',1,40),
(5,'product',1,50),
(6,'featrue',5,60),
(7,'deployment',5,70);

truncate state;
insert into state values 
(10,'S0',1,''),
(11,'S1',1,''),
(12,'S2',1,''),
(13,'S3',1,''),
(14,'S4',1,''),



(50,'apply',5,''),
(51,'init',5,''),
(52,'building',5,''),
(53,'stable',5,''),
(54,'active',5,''),
(55,'close',5,''),

(60,'申请',6,''),
(61,'设计',6,''),
(62,'开发',6,''),
(63,'内测',6,''),
(64,'公测',6,''),
(65,'发布',6,''),
(66,'失效',6,''),

(70,'纸面',7,'没有分配硬件资源，仅仅是纸面上的部署。'),
(71,'离线',7,'有硬件资源，不对外提供服务。'),
(72,'在线',7,'有硬件资源，正对外提供服务。');


insert into input values 
(700,'资源到位',7,'硬件资源和权限已经分配就绪。'),
(701,'部署完毕',7,''),
(702,'重新部署',7,''),
(703,'终止',7,'');

insert into output values 
(700,'开始部署',7,'');

insert into F values 
(700,70,700,71,'700',''),
(701,71,701,72,'',''),
(702,72,702,71,'',''),
(703,72,703,70,'',''),
(704,71,703,70,'','');
